; domain
; run by both planners
; this domain is to evaluate transport model 3 mapping
(define (domain Transport)
(:requirements :strips :typing)

(:types
    WorkPiece
    Point
    Conveyor
)

(:predicates
    ;product predicate
    (position ?WP - WorkPiece ?Point - Point)

    ;component state predicate
    (moveforward ?Conv - Conveyor)
    (movebackward ?Conv - Conveyor)

    ; map building predicate
    (next ?P1 ?P2 - Point ?Conv - Conveyor)
    (before ?P2 ?P1 - Point ?Conv - Conveyor)
    (connect ?P1 ?P2 - Point)
)

(:action start_moveforward
    :parameters (?Conv - Conveyor)
    :precondition (and 
        (movebackward ?Conv)
    )
    :effect (and 
        (not (movebackward ?Conv))
        (moveforward ?Conv)
    )
)

(:action start_movebackward
    :parameters (?Conv - Conveyor)
    :precondition (and 
        (moveforward ?Conv)
    )
    :effect (and 
        (not (moveforward ?Conv))
        (movebackward ?Conv)
    )
)

(:action moveforward
    :parameters (?WP - WorkPiece ?Conv - Conveyor ?P1 ?P2 - Point)
    :precondition (and 
        (position ?WP ?P1)
        (moveforward ?Conv)
        (next ?P1 ?p2 ?Conv)
    )
    :effect (and 
        (not (position ?WP ?P1))
        (position ?WP ?P2)
    )
)

(:action movebackward
    :parameters (?WP - WorkPiece ?Conv - Conveyor ?P1 ?P2 - Point)
    :precondition (and 
        (position ?WP ?P1)
        (movebackward ?Conv)
        (before ?P1 ?p2 ?Conv)
    )
    :effect (and 
        (not (position ?WP ?P1))
        (position ?WP ?P2)
    )
)

(:action change_conv
    :parameters (?WP - WorkPiece ?P1 ?P2 - Point)
    :precondition (and 
        (position ?WP ?P1)
        (connect ?P1 ?P2)
    )
    :effect (and 
        (not (position ?WP ?P1))
        (position ?WP ?P2)
    )
)

)

; problem
; in this file also discribe the LSC and PAC in Figure 5.16 on P.54
; the workpiece is different definited
(define (problem Transport_prob) (:domain Transport)
(:objects 
    WP1 WP2 - WorkPiece
    Conv1 Conv2 - Conveyor
    PA1 PA2 PA3 PA4 PA5 PB1 PB2 - Point
)

(:init
    ; product predicates
    (position WP1 PA1)
    (position WP2 PB2)

    ; component state predicates
    (moveforward Conv1)
    (moveforward Conv2)

    ;map constracture
    ;bidirection
    ; (connect PA2 PA1 Conv1)
    ; (connect PA3 PA2 Conv1)
    ; (connect PA4 PA3 Conv1)
    ; (connect PA5 PA4 Conv1)
    ; (connect PB1 PA3 Conv2)
    ; (connect PB2 PB1 Conv2)

    ;one direction
    (next PA1 PA2 Conv1)
    (next PA2 PA3 Conv1)
    (next PA3 PA4 Conv1)
    (next PA4 PA5 Conv1)
    (next PB1 PB2 Conv2)

    (before PA2 PA1 Conv1)
    (before PA3 PA2 Conv1)
    (before PA4 PA3 Conv1)
    (before PA5 PA4 Conv1)
    (before PB1 PA3 Conv2)
    (before PB2 PB1 Conv2)

    (connect PA3 PB1)
)

(:goal (and
    (position WP1 PB2)
    (position WP2 PA3)
    ; the strategy could be generated, but in this seneraio is unreasonable
    ; this mothed could be used in the situation in section 4.2.3
    ; but the example here is conveyor which belongs to APRM(see table 4.2 on P.32)
))

)

; plan
1. (moveforward wp1 conv1 pa1 pa2)
   deleted: (position wp1 pa1)
   added: (position wp1 pa2)
   goals met: 0 of 2
2. (moveforward wp1 conv1 pa2 pa3)
   deleted: (position wp1 pa2)
   added: (position wp1 pa3)
   goals met: 0 of 2
3. (change_conv wp1 pa3 pb1)
   deleted: (position wp1 pa3)
   added: (position wp1 pb1)
   goals met: 0 of 2
4. (moveforward wp1 conv2 pb1 pb2)
   deleted: (position wp1 pb1)
   added: (position wp1 pb2)
   goals met: 1 of 2
5. (start_movebackward conv2)
   deleted: (moveforward conv2)
   added: (movebackward conv2)
   goals met: 1 of 2
6. (movebackward wp2 conv2 pb2 pb1)
   deleted: (position wp2 pb2)
   added: (position wp2 pb1)
   goals met: 1 of 2
7. (movebackward wp2 conv2 pb1 pa3)
   deleted: (position wp2 pb1)
   added: (position wp2 pa3)
   goals met: 2 of 2
